Revit 2025 API
GlobalParametersManager.AreGlobalParametersAllowed Method
 Tests whether global parameters are allowed in the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static bool AreGlobalParametersAllowed(
	Document document
)
Public Shared Function AreGlobalParametersAllowed (
	document As Document
) As Boolean
public:
static bool AreGlobalParametersAllowed(
	Document^ document
)
static member AreGlobalParametersAllowed :
        document : Document -> bool
Parameters
document Document
 A revit document of interest.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 First of all, global parameters can be had in main project documents only; they are not supported in family documents. However, there may also be other circumstances due to which global parameters may be disallowed in a particular project, either temporarily or permanently.
Example
/// <summary>
/// Tests whether there are any global parameters present in the given document
/// </summary>
/// <param name="document">Revit project document.</param>
/// <returns>A set of ElementIds of global parameter elements</returns>
public bool ContainsGlobalParameters(Document document)
{
    // Global parameters are not available in all documents.
    // They are available in projects, but not in families.
    if (GlobalParametersManager.AreGlobalParametersAllowed(document))
    {
        return (GlobalParametersManager.GetAllGlobalParameters(document).Count > 0);
    }
    return false;
}
' <summary>
' Tests whether there are any global parameters present in the given document
' </summary>
' <param name="document">Revit project document.</param>
' <returns>A set of ElementIds of global parameter elements</returns>
Public Function ContainsGlobalParameters(document As Document) As Boolean
    ' Global parameters are not available in all documents.
    ' They are available in projects, but not in families.
    If GlobalParametersManager.AreGlobalParametersAllowed(document) Then
        Return (GlobalParametersManager.GetAllGlobalParameters(document).Count > 0)
    End If
    Return False
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
GlobalParametersManager Class
Autodesk.Revit.DB Namespace